<template>
  <div class="post">
    <div>
      <p>
        <span class="begin">插入排序</span>
        是一种简单的排序算法。它的工作原理是通过构建有序序列，对于未排序数据，在已排序序列中从后向前扫描，找到相应位置并插入。插入排序在实现上，
        通常采用 in-place
        排序，因而在从后向前扫描过程中，需要反复把已排序元素逐步向后挪位，为最新元素提供插入空间。
      </p>
      <span>插入排序算法的运作如下：</span>
      <ul>
        <li>从第一个元素开始，该元素可以认为已经被排序。</li>
        <li>
          取出下一个元素，在已经排序的元素序列中从后向前扫描，如果该元素大于新元素，将该元素移到下一位置。
        </li>
        <li>重复步骤 2，直到找到已排序的元素小于或者等于新元素的位置，将新元素插入到该位置后。</li>
        <li>重复步骤 2~3，直到完成排序。</li>
      </ul>
      <p>插入排序平均时间复杂度 O(n^2)，在最好情况下复杂度为 O(n)，在最坏情况下复杂度为 O(n^2)。</p>
    </div>
  </div>
</template>
<script>
export default {
  name: 'InsertionSort'
}
</script>
