<template>
  <div class="post">
    <div>
      <p>
        <span class="begin">归并排序</span>
        是创建在归并操作上的一种有效的排序算法。归并操作也叫归并算法，指的是将两个已经排序的序列合并成一个序列的操作。归并排序时间复杂度为
        O(nlogn)。该算法是采用分治法的一个非常典型的应用，且各层分治递归可以同时进行。
      </p>
      <span>归并排序算法的运作如下：</span>
      <ul>
        <li>
          将长度为 n 的序列每相邻两个数字进行归并操作，形成 n/2
          个序列，排序后每个序列包含二或一个元素。
        </li>
        <li>
          若此时序列数不是 1 个则将上述序列再次归并，形成 n/4 个序列，每个序列包含三或四个元素。
        </li>
        <li>重复步骤 2，直到所有元素排序完毕，即序列数为 1，即完成排序。</li>
      </ul>
      <p>归并排序平均时间复杂度稳定在 O(nlogn)。</p>
    </div>
  </div>
</template>
<script>
export default {
  name: 'MergeSort'
}
</script>
