<template>
  <div class="post">
    <div>
      <p>
        <span class="begin">选择排序</span>
        是一种简单直观的排序算法。首先在未排序序列中找到最小（大）元素，存放到排序序列的起始位置，然后，再从剩余未排序元素中继续寻找最小（大）元素，然后放到已排序序列的末尾。以此类推，直到所有元素均排序完毕。
      </p>
      <span>选择排序算法的运作如下：</span>
      <ul>
        <li>初始状态：无序区为 R[1..n]，有序区为空。</li>
        <li>
          第 i 轮排序开始时，当前有序区和无序区分别为 R[1..i-1] 和
          R[i..n]。然后从当前无序区中选出最小值，将它与无序区的第一个值交换，使得新增一位有序区和减少一位无序区。
        </li>
        <li>n-1 轮排序结束，数组全部变为有序区，从而完成排序。</li>
      </ul>
      <p>
        选择排序的主要优点与数据移动有关。如果某个元素位于正确的最终位置上，则它不会被移动。选择排序每次交换一对元素，它们当中至少有一个将被移到其最终位置上，因此对
        n 个元素的表进行排序总共进行至多 n-1
        次交换。在所有的完全依靠交换去移动元素的排序方法中，选择排序属于非常好的一种。
      </p>
      <p>选择排序平均时间复杂度稳定在 O(n^2)。</p>
    </div>
  </div>
</template>
<script>
export default {
  name: 'SelectionSort'
}
</script>
